
每个进程都由一个进程号来标识,其类型为pid_t(整型),范围 0 ~ 32767.
进程号总是唯一的,但进程号可以重用.当一个进程终止后,其进程号可以再次使用.

有三种进程号:

进程号(PID) : 标识进程的一个非负整数

父进程号(PPID) : 任何进程(除了init进程)都是由另一个进程创建的.
如: A进程创建了B进程,B进程的父进程号就是A进程的进程号.

进程组号(PGID) : 进程组是一个或多个进程的集合.相互关联的进程有一个进程组号.

--------------------------------------------------------------------------------
1. getpid 函数

#include<sys/types.h>
#include<unistd.h>

pid_t getpid(void) 

功能: 获取本进程号(PID)

参数: 无

返回值: 本进程号

---------------------------------------------------------------------------------
2. getppid 函数

#include<sys/types.h>
#include<unistd.h>

pid_t getppid(void)

功能: 获取调用此函数的进程的父进程号(PPID)

参数: 无

返回值: 调用此函数的进程的父进程号(PPID)

---------------------------------------------------------------------------------
3. getpgid 函数

#include<sys/types.h>
#include<unistd.h>

pid_t getpgid(pid_t pid)

功能: 获取进程组号(PGID)

参数: 
    pid : 进程号

返回值: 参数为0时返回当前进程组号,否则返回参数指定的进程的进程组号

-----------------------------------------------------------------------------------
