前缀和数组 
arr[]={1,3,7,5,2};
sum[i]=sum[i-1]+arr[i];// 当i>0 时
sum[0]=arr[o];//当i==0时

求sum在区间[2,4]的值

则需要sum[4]-sum[1]

因此,当求sum在区间[L,R]的值时,可以用sum[R]-sum[L-1];

差分数组(前缀差)
arr[]={1,3,7,5,2};
d[i]=arr[i]-arr[i-1]  ;//当i>0时 
d[0]=arr[0];//当i==0时
而sumd[]={1,3,7,5,2}//即差分数组的前缀和数组为原数组

差分标记  当在[L,R]+value操作时,等价于d[L]+value  d[R+1]-value;

例如,对arr[]={1,3,7,5,2}进行[2,4]+5  [1,3]+2  [0,2]-3的操作后,求出操作后的arr

d[]={1,2,4,-2,-3}   

[2,4]+5时 d[]={1,2,9,-2,-3};

[1,3]+2时 d[]={1,4,9,-2,-5};

[0,2]-3时 d[]={-2,4,9,1,-5};

再sumd={-2,2,11,12,7};  即改变后的arr[]={-2,2,11,12,7};


