利用函数求两数较大值：
#include<stdio.h>
int Max(int x, int y)
{
	if (x > y)
		return x;
	else
		return y;
}
int main()
{
	int num1 = 10;
	int num2 = 20;
	int max = 0;
	max = Max(num1, num2);
	printf("较大值是:%d\n", max);
	return 0;
}
-------------------------------------------------------------
前置++与后置++
int a =10
int b = ++a  //打印:b=11 .a=11 先++后使用


int a =10
int b =a++   //打印:b=10 ,a=11  先使用后++
--------------------------------------------------------------
条件操作符
exp1 ? exp2 : exp3    //若exp1为真，则输出exp2；若exp1为假，则输出exp2

----------------------------------------------------------------------
#define定义宏----带变量的定义

#include<stdio.h>
#define MAX(x,y) x>y?x:y
int main()
{
	int a = 10;
	int b = 20;
	int max = MAX(a, b);
	printf("max =%d\n", max);
	return 0;
}

---------------------------------------------------------------------------
取地址&
有一种变量是用来存放地址的-指针变量


int main()
{
	int a = 10;
        int* p = &a   //取地址
	printf("%p\n", &a);
        printf("%p\n", p);
	return 0;
}

------------------------------------------------------------------
解引用操作符*       相当于取地址后对原数据进行替换
int a = 10;
int* p =&a;
*p = 20;
printf("%d\n",a);
//输出为20
--------------------------------------------------------------
