常量
1.字面常量
2.const修饰的常变量   //当const int num = 4 时，变量num不再改变
3.#define定义的标识符常量    
4.枚举常量   //enum 

----------------------------------------------------------------------------
字符串-----------打印字符串用%s
计算字符串长度
#include<stdio.h>
#include<string.h>
int main()
{
	char arr[] = "abc";
	printf("%d\n", strlen(arr));
	return 0;
}                      //使用strlen函数时需加上string.h
---------------------------------------------------------------------------------
转义字符
\n代表换行.........
\ddd数字为八进制 ----------------\32 对应ASCII码值为十进制中的26       //如果代码中存在\328，但为八进制，则程序报错
\xdd数字为十六进制-------------\x61对于ASCII码值为十进制中的97
----------------------------------------------------------------------------------
选择语句
#include<stdio.h>
#include<string.h>
int main()
{
	int input = 0;
	printf("你想赚钱吗？\n");
	printf("输入1为是，输入2为否\n");
	scanf_s("%d", &input);
	if (input == 1)
	{
		printf("你将获得赚钱机会\n");
	}
	else
	{
		printf("你失去了赚钱的机会\n");
	}
	return 0;
}                    //if后面不加;   否则else语句不能识别if


-----------------------------------------------------------------------------
循环语句
#include<stdio.h>
int main()
{
	int money = 1;
	while (money < 2000)
	{
		printf("增加一块钱: %d\n",money);
		money++;
	}
	printf("你积累了2000块钱\n");
	return 0;
}                  //++代表变量+1
-------------------------------------------------------------------------------------------
函数Add
相加型函数
#include<stdio.h>
int Add(int x, int y)
{
	int z = x + y;
	return z;
}
int main()
{
		int a = 0;
		int b = 0;
		int sum = 0;
		scanf_s("%d%d",&a,&b);
		 sum = Add(a, b);
		 printf("sum = %d\n",sum);
	return 0;
}                  //写main函数之前先定义Add函数内容
 -------------------------------------------------------------------------------------------------
数组
int arr[4] = {1,2,3,4};
//数组中的元素以0开头编号
